//----------------------------------------------------------------------------
#ifndef PRINTING_H
#define PRINTING_H
//----------------------------------------------------------------------------
#include <iostream>
#include <iomanip>
#include <cstring>  // Для корректной работы функции PrintTabl на GCC C++
//----------------------------------------------------------------------------
struct I_print {    // Данные для печати результатов интегрирования
	char *name;     // Название функции
	double i_sum;   // Значение интегральной суммы
	double i_toch;  // Точное значение интеграла
	int n;          // Число разбиений области интегрирования
	                // При котором достигнута требуемая точность
};
//----------------------------------------------------------------------------
void InputData(double &a, double &b, double &EPS);
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void PrintTabl(I_print i_prn[], int k);
//----------------------------------------------------------------------------
#endif // PRINTING_H
//----------------------------------------------------------------------------